package by.andruhovich.Task30;

/*
Создать коллекцию, наполнить ее случайными числами. Удалить повторяющиеся числа.
 */

public class Start {
    public static void main(String[] args) {
        Lisst lisst = new Lisst();
        lisst.formingLisst();
        System.out.println(lisst);
    }
}
